app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments" ORDER BY appt_time ASC
---
  def index
    @appointments = Appointment.order('appt_time ASC')

INSERT INTO "appointments" ("title", "appt_time", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Meet someone"], ["appt_time", "2018-02-21 18:14:00"], ["created_at", "2017-12-07 06:19:33.609768"], ["updated_at", "2017-12-07 06:19:33.609768"]]
---
  def create
    @appointment = Appointment.new(appointment_params)
    if @appointment.save

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 1]]
SELECT "appointments".* FROM "appointments" ORDER BY appt_time ASC
---
  def destroy
   @appointment = Appointment.find(params[:id])
    if @appointment.destroy
      @appointments = Appointment.order('appt_time ASC')

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "appointments" SET "title" = ?, "appt_time" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["title", "Meetingsss"], ["appt_time", nil], ["updated_at", "2018-01-17 00:40:03.177516"], ["id", 75]]
SELECT "appointments".* FROM "appointments" ORDER BY appt_time ASC
---
  def update
    appointment = Appointment.find(params[:id])
    title = params[:editedAppointment][:title]
    date = params[:editedAppointment][:appt_time]
    if appointment.update_attributes(title: title, appt_time: date)
      @appointments = Appointment.order('appt_time ASC')